In [17]:
# Dependencies
import pandas as pd
from pathlib import Path
import os

In [18]:
# Save path to the data set as a variable.
csv_car_purchases = os.path.join("Resources", "car_purchases.csv")

In [19]:
df_car_purchases = pd.read_csv(csv_car_purchases)
display(df_car_purchases.head())

   id           Full Name  Gender   Amount       Car
0   1        Minnnie Rean    male  15484.5      Jeep
1   2     Ursa Torricella  female  13443.3    Saturn
2   3     Joyann Pirolini    male   9095.6       Ram
3   4      Sharl Ridsdell  female  11871.6     Dodge
4   5  Laurence Jovasevic    male  13459.8  Chrysler

In [3]:
# Use Pandas to read the data

   id           Full Name  Gender   Amount       Car
0   1        Minnnie Rean    male  15484.5      Jeep
1   2     Ursa Torricella  female  13443.3    Saturn
2   3     Joyann Pirolini    male   9095.6       Ram
3   4      Sharl Ridsdell  female  11871.6     Dodge
4   5  Laurence Jovasevic    male  13459.8  Chrysler

In [24]:
print("DataFrame Information:")
display(df_car_purchases.info())
display(df_car_purchases.head())

DataFrame Information:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         1000 non-null   int64
 1   Full Name  1000 non-null   object
 2   Gender     1000 non-null   object
 3   Amount     1000 non-null   float64
 4   Car        1000 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 39.2+ KB

None

   id           Full Name  Gender   Amount       Car
0   1        Minnnie Rean    male  15484.5      Jeep
1   2     Ursa Torricella  female  13443.3    Saturn
2   3     Joyann Pirolini    male   9095.6       Ram
3   4      Sharl Ridsdell  female  11871.6     Dodge
4   5  Laurence Jovasevic    male  13459.8  Chrysler

In [4]:
# Display a statistical overview of the DataFrame.

                id        Amount
count  1000.000000   1000.000000
mean    500.500000   9988.738100
std     288.819436   5783.375372
min       1.000000     15.300000
25%     250.750000   5043.150000
50%     500.500000   9899.500000
75%     750.250000  15044.225000
max    1000.000000  19927.900000

In [16]:
# Display information about the DataFrame
print("car_purchases DataFrame Information:")
display(car_purchases.info())
display(car_purchases.head())

car_purchases DataFrame Information:
<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, count to max
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      8 non-null      float64
 1   Amount  8 non-null      float64
dtypes: float64(2)
memory usage: 192.0+ bytes

None

                id       Amount
count  1000.000000  1000.000000
mean    500.500000  9988.738100
std     288.819436  5783.375372
min       1.000000    15.300000
25%     250.750000  5043.150000

In [26]:
# Reference a single column and display its details
column_name = 'Amount'
selected_column = car_purchases[column_name]

print(f"\nDetails for the '{column_name}' column:")
print(f"Column Name: {column_name}")
print(f"Data Type: {selected_column.dtype}")
print(f"Number of Non-null Values: {selected_column.count()}")
print(f"Mean: {selected_column.mean()}")
print(f"Standard Deviation: {selected_column.std()}")
print(f"Minimum Value: {selected_column.min()}")
print(f"Maximum Value: {selected_column.max()}")

Details for the 'Amount' column:
Column Name: Amount
Data Type: float64
Number of Non-null Values: 8
Mean: 8337.773558970097
Standard Deviation: 6813.412997053456
Minimum Value: 15.3
Maximum Value: 19927.9

In [30]:
test_score_column = df_car_purchases['Amount']

# Display the content of the 'Test Score' column
print("Content of the 'Amount' column:")
print(test_score_column)

Content of the 'Amount' column:
0      15484.5
1      13443.3
2       9095.6
3      11871.6
4      13459.8
        ...
995     9795.0
996    19485.4
997    19330.8
998    16113.7
999     7637.8
Name: Amount, Length: 1000, dtype: float64

In [31]:
# Reference a single column within a DataFrame.
df[['Amount']]

      Amount
0    15484.5
1    13443.3
2     9095.6
3    11871.6
4    13459.8
..       ...
995   9795.0
996  19485.4
997  19330.8
998  16113.7
999   7637.8

[1000 rows x 1 columns]

In [6]:
# Reference multiple columns within a DataFrame.

    Amount  Gender
0  15484.5    male
1  13443.3  female
2   9095.6    male
3  11871.6  female
4  13459.8    male

In [7]:
# The mean method averages the series

9988.738099999993

In [8]:
# The sum method adds every entry in the series

9988738.100000001

In [32]:
# Get unique values from the entire DataFrame
unique_values = df_car_purchases.values.flatten()

# Display unique values
print("Unique values in the entire DataFrame:")
print(pd.unique(unique_values))

Unique values in the entire DataFrame:
[1 'Minnnie Rean' 'male' ... 1000 'Meta Abramovici' 7637.8]

In [9]:
# The unique method shows every element only once

array(['Jeep', 'Saturn', 'Ram', 'Dodge', 'Chrysler', 'Cadillac',
       'Pontiac', 'Nissan', 'Lexus', 'Volkswagen', 'Suzuki', 'Kia',
       'Mercury', 'Audi', 'Bugatti', 'BMW', 'Mazda', 'GMC', 'Ford',
       'Mercedes-Benz', 'Land Rover', 'Chevrolet', 'Toyota', 'Honda',
       'Subaru', 'Oldsmobile', 'MINI', 'Lincoln', 'Mitsubishi', 'Isuzu',
       'Infiniti', 'Eagle', 'Saab', 'Buick', 'Volvo', 'Lotus', 'Maserati',
       'Jensen', 'Hyundai', 'Maybach', 'Corbin', 'Acura', 'Ferrari',
       'Plymouth', 'Studebaker', 'Jaguar', 'Rolls-Royce', 'Aston Martin',
       'Merkur', 'Citroën', 'Daewoo', 'Tesla', 'Porsche', 'Scion', 'Geo',
       'Hummer', 'Lamborghini', 'Fiat', 'Bentley', 'Peugeot', 'Austin',
       'Spyker'], dtype=object)

In [10]:
# The value_counts method counts unique values in a column

male          455
female        446
non-binary     99
Name: Gender, dtype: int64

In [11]:
# Calculations can also be performed on Series and added into DataFrames as new columns

   id           Full Name  Gender   Amount       Car  Thousands of Dollars
0   1        Minnnie Rean    male  15484.5      Jeep               15.4845
1   2     Ursa Torricella  female  13443.3    Saturn               13.4433
2   3     Joyann Pirolini    male   9095.6       Ram                9.0956
3   4      Sharl Ridsdell  female  11871.6     Dodge               11.8716
4   5  Laurence Jovasevic    male  13459.8  Chrysler               13.4598